#![cfg(feature = "regex")]
use okkhor::parser::Parser;

#[test]
fn regex_test_various() {
    let p = Parser::new_regex();
    assert_eq!(
        p.convert_regex("bhl"),
        "^(((ভ|(ব্?(হ|ঃ|(হ্‌?))))্?ল)|(ব্?((হ|ঃ|(হ্‌?))্?ল))|(ব্?(হ|ঃ|(হ্‌?))্?ল))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("bj"),
        "^ব(্[যবম])?(্?)([ঃঁ]?)([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("bd"), "^(ব্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("bb"), "^(ব্?ব?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("bl"), "^ব(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("bh"), "^(ভ|(ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("vl"), "^ভ(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("b"), "^ব(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("v"), "^ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("cNG"), "^((চ্ঞ)|([চছ]্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|([চছ]্?[নণঁঙঞং]্?(গ|(জ্ঞ)))|(([চছ]্?[নণঁঙঞং])্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("cch"),
        "^(([চছ]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|([চছ]্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("cc"), "^([চছ]্?[চছ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ch"),
        "^(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("c"), "^([চছ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("dhn"), "^(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([দড]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([দড]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("dhm"), "^(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?ম)|([দড]্?((হ|ঃ|(হ্‌?))্?ম))|([দড]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("dgh"), "^(([দড]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|(([দড]্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|([দড]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ddh"), "^(([দড]?্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([দড]্?[দড]?)্?(হ|ঃ|(হ্‌?)))|([দড]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("dbh"),
        "^(([দড]্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|(([দড]্?ব)্?(হ|ঃ|(হ্‌?)))|([দড]্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("dv"),
        "^([দড])(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("dm"),
        "^([দড])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("DD"), "^([দড]্?[দড]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Dh"),
        "^(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("dh"),
        "^(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("dg"), "^([দড]্?(গ|(জ্ঞ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("dd"), "^([দড]্?[দড]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("D"), "^([দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("d"), "^([দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("..."), "^$");
    assert_eq!(p.convert_regex(".`"), "^$");
    assert_eq!(p.convert_regex(".."), "^$");
    assert_eq!(p.convert_regex("."), "^$");
    assert_eq!(p.convert_regex("ghn"), "^(((ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((গ|(জ্ঞ))্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ghn"), "^(((ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((গ|(জ্ঞ))্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("gdh"),
        "^(((গ|(জ্ঞ))্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gN"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("GN"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gn"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gm"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Gm"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gl"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Gl"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gg"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("GG"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Gg"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gG"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("gh"),
        "^(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Gh"),
        "^(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("g"), "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("hN"), "^((হ|ঃ|(হ্‌?))্?[নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("hn"), "^((হ|ঃ|(হ্‌?))্?[নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("hm"), "^((হ|ঃ|(হ্‌?))্?ম)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("hl"), "^((হ|ঃ|(হ্‌?))্?ল)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("h"), "^(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("jjh"), "^(((([জয]|(জ়)))?্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(হ্য)|(((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))্?(হ|ঃ|(হ্‌?)))|(([জয]|(জ়))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("jNG"), "^((জ্ঞ)|(([জয]|(জ়))্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|(([জয]|(জ়))্?[নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("jh"),
        "^(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("jj"),
        "^((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("j"), "^([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("J"), "^([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kkhN"), "^((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kShN"), "^((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kkhm"), "^((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?ম)|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?ম)|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kShm"), "^((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম)))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kxN"), "^((((ক্ষ)|(ক্?((ক্স)|ষ)))্?[নণঁঙঞং])|(ক্?(((ক্স)|ষ)্?[নণঁঙঞং]))|(ক্?((ক্স)|ষ)্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("kxm"),
        "^((((ক্ষ)|(ক্?((ক্স)|ষ)))্?ম)|(ক্?(((ক্স)|ষ)্?ম))|(ক্?((ক্স)|ষ)্?ম))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("kkh"), "^((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kSh"), "^((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ksh"), "^((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kx"), "^((ক্ষ)|(ক্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kk"), "^(ক্?ক?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("kT"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("kt"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("kl"), "^ক(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ks"), "^(ক্?[সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("kh"),
        "^(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("k"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("lbh"),
        "^((ল্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ল্?ব)্?(হ|ঃ|(হ্‌?)))|(ল্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("ldh"), "^((ল্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ল্?[দড])্?(হ|ঃ|(হ্‌?)))|(ল্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("lkh"),
        "^((ল্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ল্?ক)্?(হ|ঃ|(হ্‌?)))|(ল্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("lgh"), "^((ল্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((ল্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|(ল্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("lph"),
        "^((ল্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ল্?প)্?(হ|ঃ|(হ্‌?)))|(ল্?প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("lk"), "^(ল্?ক)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("lg"), "^(ল্?(গ|(জ্ঞ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("lT"),
        "^ল(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("lD"), "^(ল্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("lp"), "^(ল্?প)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("lv"), "^ল(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("lm"), "^ল(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ll"), "^((হ্ল)|(ল?্?ল)|(ল্?ল))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("lb"), "^(ল্?ব)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("l"), "^ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("mth"), "^((ম্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|((ম্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|(ম্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("mph"),
        "^((ম্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ম্?প)্?(হ|ঃ|(হ্‌?)))|(ম্?প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("mbh"),
        "^((ম্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ম্?ব)্?(হ|ঃ|(হ্‌?)))|(ম্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("mpl"),
        "^(ম্?প)(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("mn"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("mp"), "^(ম্?প)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("mv"), "^ম(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("mm"), "^((হ্ম)|(ম্?ম?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ml"), "^ম(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("mb"), "^(ম্?ব)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("mf"), "^ম(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("m"), "^ম(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("0"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("1"), "^(১|(1)|(এক))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("2"), "^(২|(2)|(দুই))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("3"), "^(৩|(3)|(তিন))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("4"), "^(৪|(4)|(চার))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("5"), "^(৫|(5)|(পাঁচ))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("6"), "^((6)|৬|(ছয়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("7"), "^(৭|(7)|(সাত))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("8"), "^(৮|(8)|(আট))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("9"), "^(৯|(9)|(নয়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("NgkSh"), "^(((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ngkkh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?ক?)্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("NGch"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Nggh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?((((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|(((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ngkh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?(হ|ঃ|(হ্‌?)))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("NGjh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ngOU"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ngOI"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ngkx"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("NGc"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nch"), "^(([নণঁঙঞং]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|(((ঞ্চ)|([নণঁঙঞং]্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("njh"), "^(([নণঁঙঞং]্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ngh"), "^((ঙ্ঘ)|([নণঁঙঞং]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Ngk"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("Ngx"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ngg"), "^((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Ngm"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ম)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ম))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("NGj"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ndh"), "^(([নণঁঙঞং]্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[দড])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nTh"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("NTh"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nth"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nkh"), "^(([নণঁঙঞং]্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(((ঙ্ক)|([নণঁঙঞং]্?ক))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ngo"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nga"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ngi"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ngI"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ngu"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ngU"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nge"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ngO"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("NDh"), "^(([নণঁঙঞং]্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[দড])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("nsh"),
        "^(([নণঁঙঞং]্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Ngr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("NGr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ngr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("nj"),
        "^((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Ng"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("NG"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nk"), "^((ঙ্ক)|([নণঁঙঞং]্?ক))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ng"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("nn"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("NN"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Nn"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("nm"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Nm"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nd"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nT"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("NT"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nD"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ND"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("nt"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ns"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("nc"), "^((ঞ্চ)|([নণঁঙঞং]্?[চছ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("n"), "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("N"), "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("OI`"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("OU`"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("O`"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("kOI"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex(" OI"),
        "^ (ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("(OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex(".OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("kOU"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex(" OU"),
        "^ (ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("-OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex(",,OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("O"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("pO"),
        "^প(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex(" O"), "^ ([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("iO"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("`O"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("phl"),
        "^(((ফ|(প্?(হ|ঃ|(হ্‌?))))্?ল)|(প্?((হ|ঃ|(হ্‌?))্?ল))|(প্?(হ|ঃ|(হ্‌?))্?ল))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("pT"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("pt"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("pn"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("pp"), "^(প্?প?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("pl"), "^প(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ps"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("ph"), "^(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("fl"), "^ফ(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("f"), "^ফ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("p"), "^প(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("rri`"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("krri"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("Irri"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("^rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex(":rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("krZ"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("rrZ"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("yrZ"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("wrZ"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("xrZ"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("irZ"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("-rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("rrrZ"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ry"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("qry"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("rry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("yry"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("wry"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("xry"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("0ry"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("rrrry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Rry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("rr"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("arr"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("arrk"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("arra"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("arr"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("arr!"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("krr"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("krra"), "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Rg"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Rh"),
        "^((([রড়ঢ়]|(হ্র)))|(([রড়ঢ়]|(হ্র))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("R"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("r"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("or"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("mr"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("1r"),
        "^(১|(1)|(এক))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("+r"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("rr"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("yr"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("wr"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("xr"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("zr"),
        "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("mri"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(হৃ)|(([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("shch"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ShTh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Shph"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sch"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("skl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("skh"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sth"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sph"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("shc"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sht"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("shn"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("shm"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("shl"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Shk"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ShT"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("ShN"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Shp"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Shf"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("Shm"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("spl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sk"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sc"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sT"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("st"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sn"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sp"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sf"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sm"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("sh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sc"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("St"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sn"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sm"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Sh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("s"), "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("S"), "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("oo"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("OO"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("oo`"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("koo"), "^ক(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ooo"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("!oo"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("!ooo"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("aoo"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("oop"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ooo`"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("o`"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("oZ"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("oY"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("!o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("^o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("*o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("io"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("yo"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("no"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("tth"), "^(([তটৎ]?্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([তটৎ]্?[তটৎ]?)্?(হ|ঃ|(হ্‌?)))|([তটৎ]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("t``"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("`t``"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("t``t``"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("t```"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("TT"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("Tm"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Th"),
        "^(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("tn"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("tm"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("th"),
        "^(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("tt"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("T"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("t"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("aZ"),
        "^((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((জ|য|(জ়)|([‌‍]?্য)))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("aaZ"), "^(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("AZ"),
        "^((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((জ|য|(জ়)|([‌‍]?্য)))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("a`"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("a``"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ka`"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("A`"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("a"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("`a"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("k`a"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ia"),
        "^((ঞা)|(([ইঈিী]|(য়[িী]))(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("aaaa`"), "^(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("i`"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("i"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("`i"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("hi"),
        "^(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ih"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("i`h"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("I`"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("I"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("cI"),
        "^([চছ])(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Ix"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("II"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("0I"),
        "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("oI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("u`"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("u"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ku"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("uk"),
        "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("uu"),
        "^(ঊ|ূ|(([উঊুূ]|(য়[ুূ]))(([উঊুূ]|(য়[ুূ])))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("iu"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("&u"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("u&"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("U`"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("U"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("yU"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("Uy"),
        "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("^U"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("U^"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("EE"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ee"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Ee"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("eE"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ee`"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("kee"), "^ক(্[যবম])?(্?)([ঃঁ]?)(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("eek"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("0ee"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("ee8"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)(৮|(8)|(আট))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("(ee)"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("e`"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("e"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ke"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("we"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("#e#"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("`e`"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("z"), "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Z"), "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("kZS"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("y"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("oy"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ky"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ya"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("yaa"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Y"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("YY"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("iY"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("kY"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("q"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("Q"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("w"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("wa"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("-wa-"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("woo"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("wre"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("kw"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex("x"), "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("ex"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("bx"),
        "^ব(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex(":`"), "^$");
    assert_eq!(p.convert_regex(":"), "^$");
    assert_eq!(p.convert_regex("^`"), "^$");
    assert_eq!(p.convert_regex("^"), "^$");
    assert_eq!(p.convert_regex("k^"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert_regex("k^i"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert_regex("ki^"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert_regex(",,"), "^$");
    assert_eq!(p.convert_regex(",,,"), "^$");
    assert_eq!(p.convert_regex(",,`,"), "^$");
    assert_eq!(p.convert_regex("`,,"), "^$");
    assert_eq!(p.convert_regex(",`,"), "^$");
    assert_eq!(p.convert_regex("$"), "^$");
    assert_eq!(p.convert_regex("`"), "^$");
    assert_eq!(p.convert_regex("bdh"), "^((ব্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ব্?[দড])্?(হ|ঃ|(হ্‌?)))|(ব্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
}

#[test]
fn regex_word() {
    let p = Parser::new_regex();
    assert_eq!(p.convert_regex("osthir"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্\u{200C}?))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert_regex("OSTHIR"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্\u{200C}?))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
}
