#![cfg(feature = "regex")]
use okkhor::parser::Phonetic;

#[test]
fn regex_test() {
    let p = Phonetic::new_regex();
    assert_eq!(
        p.convert("bhl"),
        "^(((ভ|(ব্?(হ|ঃ|(হ্‌?))))্?ল)|(ব্?((হ|ঃ|(হ্‌?))্?ল))|(ব্?(হ|ঃ|(হ্‌?))্?ল))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("bj"),
        "^ব(্[যবম])?(্?)([ঃঁ]?)([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("bd"), "^(ব্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("bb"), "^(ব্?ব?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("bl"), "^ব(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("bh"), "^(ভ|(ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("vl"), "^ভ(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("b"), "^ব(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("v"), "^ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("cNG"), "^((চ্ঞ)|([চছ]্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|([চছ]্?[নণঁঙঞং]্?(গ|(জ্ঞ)))|(([চছ]্?[নণঁঙঞং])্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("cch"),
        "^(([চছ]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|([চছ]্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("cc"), "^([চছ]্?[চছ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ch"),
        "^(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("c"), "^([চছ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("dhn"), "^(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([দড]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([দড]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("dhm"), "^(((ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))্?ম)|([দড]্?((হ|ঃ|(হ্‌?))্?ম))|([দড]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("dgh"), "^(([দড]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|(([দড]্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|([দড]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ddh"), "^(([দড]?্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([দড]্?[দড]?)্?(হ|ঃ|(হ্‌?)))|([দড]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("dbh"),
        "^(([দড]্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|(([দড]্?ব)্?(হ|ঃ|(হ্‌?)))|([দড]্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("dv"),
        "^([দড])(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("dm"),
        "^([দড])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("DD"), "^([দড]্?[দড]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Dh"),
        "^(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("dh"),
        "^(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("dg"), "^([দড]্?(গ|(জ্ঞ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("dd"), "^([দড]্?[দড]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("D"), "^([দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("d"), "^([দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("..."), "^$");
    assert_eq!(p.convert(".`"), "^$");
    assert_eq!(p.convert(".."), "^$");
    assert_eq!(p.convert("."), "^$");
    assert_eq!(p.convert("ghn"), "^(((ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((গ|(জ্ঞ))্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ghn"), "^(((ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((গ|(জ্ঞ))্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("gdh"),
        "^(((গ|(জ্ঞ))্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gN"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("GN"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gn"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gm"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Gm"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gl"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Gl"),
        "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gg"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("GG"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Gg"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gG"),
        "^((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("gh"),
        "^(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Gh"),
        "^(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("g"), "^(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("hN"), "^((হ|ঃ|(হ্‌?))্?[নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("hn"), "^((হ|ঃ|(হ্‌?))্?[নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("hm"), "^((হ|ঃ|(হ্‌?))্?ম)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("hl"), "^((হ|ঃ|(হ্‌?))্?ল)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("h"), "^(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("jjh"), "^(((([জয]|(জ়)))?্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(হ্য)|(((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))্?(হ|ঃ|(হ্‌?)))|(([জয]|(জ়))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("jNG"), "^((জ্ঞ)|(([জয]|(জ়))্?(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ)))))|(([জয]|(জ়))্?[নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("jh"),
        "^(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("jj"),
        "^((হ্য)|(([জয]|(জ়))্?(([জয]|(জ়)))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("j"), "^([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("J"), "^([জয]|(জ়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kkhN"), "^((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kShN"), "^((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং])))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kkhm"), "^((((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))্?ম)|((ক্?ক?)্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?ক্?(হ|ঃ|(হ্‌?))্?ম)|(ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kShm"), "^((((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম)))|((ক্?[সশষ])্?((হ|ঃ|(হ্‌?))্?ম))|(ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kxN"), "^((((ক্ষ)|(ক্?((ক্স)|ষ)))্?[নণঁঙঞং])|(ক্?(((ক্স)|ষ)্?[নণঁঙঞং]))|(ক্?((ক্স)|ষ)্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("kxm"),
        "^((((ক্ষ)|(ক্?((ক্স)|ষ)))্?ম)|(ক্?(((ক্স)|ষ)্?ম))|(ক্?((ক্স)|ষ)্?ম))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("kkh"), "^((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kSh"), "^((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ksh"), "^((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kx"), "^((ক্ষ)|(ক্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kk"), "^(ক্?ক?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("kT"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("kt"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("kl"), "^ক(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ks"), "^(ক্?[সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("kh"),
        "^(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("k"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("lbh"),
        "^((ল্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ল্?ব)্?(হ|ঃ|(হ্‌?)))|(ল্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("ldh"), "^((ল্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ল্?[দড])্?(হ|ঃ|(হ্‌?)))|(ল্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("lkh"),
        "^((ল্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ল্?ক)্?(হ|ঃ|(হ্‌?)))|(ল্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("lgh"), "^((ল্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((ল্?(গ|(জ্ঞ)))্?(হ|ঃ|(হ্‌?)))|(ল্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("lph"),
        "^((ল্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ল্?প)্?(হ|ঃ|(হ্‌?)))|(ল্?প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("lk"), "^(ল্?ক)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("lg"), "^(ল্?(গ|(জ্ঞ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("lT"),
        "^ল(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("lD"), "^(ল্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("lp"), "^(ল্?প)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("lv"), "^ল(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("lm"), "^ল(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ll"), "^((হ্ল)|(ল?্?ল)|(ল্?ল))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("lb"), "^(ল্?ব)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("l"), "^ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("mth"), "^((ম্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|((ম্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|(ম্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("mph"),
        "^((ম্?(ফ|(প্?(হ|ঃ|(হ্‌?)))))|((ম্?প)্?(হ|ঃ|(হ্‌?)))|(ম্?প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("mbh"),
        "^((ম্?(ভ|(ব্?(হ|ঃ|(হ্‌?)))))|((ম্?ব)্?(হ|ঃ|(হ্‌?)))|(ম্?ব্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("mpl"),
        "^(ম্?প)(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("mn"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("mp"), "^(ম্?প)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("mv"), "^ম(্[যবম])?(্?)([ঃঁ]?)ভ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("mm"), "^((হ্ম)|(ম্?ম?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ml"), "^ম(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("mb"), "^(ম্?ব)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("mf"), "^ম(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("m"), "^ম(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("0"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("1"), "^(১|(1)|(এক))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("2"), "^(২|(2)|(দুই))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("3"), "^(৩|(3)|(তিন))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("4"), "^(৪|(4)|(চার))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("5"), "^(৫|(5)|(পাঁচ))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("6"), "^((6)|৬|(ছয়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("7"), "^(৭|(7)|(সাত))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("8"), "^(৮|(8)|(আট))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("9"), "^(৯|(9)|(নয়))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("NgkSh"), "^(((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|((ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|(ক্?[সশষ]্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?[সশষ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ngkkh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|((ক্?ক?)্?(হ|ঃ|(হ্‌?)))|(ক?্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(ক্?ক্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ক্?ক?)্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("NGch"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Nggh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?((((জ্ঞ)|((গ|(জ্ঞ))্?((গ|(জ্ঞ)))?))্?(হ|ঃ|(হ্‌?)))|((গ|(জ্ঞ))্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|((গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))|(((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ngkh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?(হ|ঃ|(হ্‌?)))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("NGjh"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ngOU"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ngOI"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ngkx"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|((((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্ষ)|(ক্?((ক্স)|ষ))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("NGc"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?[চছ])|([নণঁঙঞং]্?(গ|(জ্ঞ))্?[চছ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nch"), "^(([নণঁঙঞং]্?(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?)))))|(((ঞ্চ)|([নণঁঙঞং]্?[চছ]))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("njh"), "^(([নণঁঙঞং]্?(ঝ|(([জয]|(জ়))্?(হ|ঃ|(হ্‌?)))))|(((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?([জয]|(জ়))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ngh"), "^((ঙ্ঘ)|([নণঁঙঞং]্?(ঘ|((গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Ngk"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ক)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ক))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("Ngx"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?((ক্স)|ষ))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?((ক্স)|ষ)))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ngg"), "^((ঙ্গ)|((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?(গ|(জ্ঞ)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Ngm"),
        "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?ম)|([নণঁঙঞং]্?(গ|(জ্ঞ))্?ম))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("NGj"), "^(((ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))্?([জয]|(জ়)))|([নণঁঙঞং]্?(গ|(জ্ঞ))্?([জয]|(জ়))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ndh"), "^(([নণঁঙঞং]্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[দড])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nTh"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("NTh"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nth"), "^(([নণঁঙঞং]্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[তটৎ])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nkh"), "^(([নণঁঙঞং]্?(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?)))))|(((ঙ্ক)|([নণঁঙঞং]্?ক))্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ngo"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nga"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ngi"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ngI"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ngu"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ngU"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nge"), "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ngO"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("NDh"), "^(([নণঁঙঞং]্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|(([নণঁঙঞং]্?[দড])্?(হ|ঃ|(হ্‌?)))|([নণঁঙঞং]্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("nsh"),
        "^(([নণঁঙঞং]্?(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?)))))|([নণঁঙঞং]্?[সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Ngr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("NGr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ngr"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("nj"),
        "^((ঞ্জ)|([নণঁঙঞং]্?([জয]|(জ়))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Ng"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("NG"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nk"), "^((ঙ্ক)|([নণঁঙঞং]্?ক))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ng"),
        "^(ঙ|ং|ঞ|(ঙ্গ)|([নণঁঙঞং]্?(গ|(জ্ঞ))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("nn"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("NN"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Nn"),
        "^((হ্ণ)|(হ্ন)|([নণঁঙঞং]্?[নণঁঙঞং]?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("nm"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Nm"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nd"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nT"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("NT"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nD"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ND"), "^([নণঁঙঞং]্?[দড])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("nt"), "^([নণঁঙঞং]্?[তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ns"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("nc"), "^((ঞ্চ)|([নণঁঙঞং]্?[চছ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("n"), "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("N"), "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("OI`"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("OU`"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("O`"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("kOI"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert(" OI"),
        "^ (ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("(OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert(".OI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("kOU"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert(" OU"),
        "^ (ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("-OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert(",,OU"),
        "^(ঔ|ৌ|(([ওোঅ]|(অ্য)|(য়ো?))?([উঊুূ]|(য়[ুূ]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("O"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("pO"),
        "^প(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert(" O"), "^ ([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("iO"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("`O"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("phl"),
        "^(((ফ|(প্?(হ|ঃ|(হ্‌?))))্?ল)|(প্?((হ|ঃ|(হ্‌?))্?ল))|(প্?(হ|ঃ|(হ্‌?))্?ল))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("pT"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("pt"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("pn"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("pp"), "^(প্?প?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("pl"), "^প(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ps"),
        "^প(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("ph"), "^(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("fl"), "^ফ(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("f"), "^ফ(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("p"), "^প(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("rri`"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("krri"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("Irri"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("^rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert(":rri"),
        "^(ঋ|ৃ|(([রড়ঢ়]|(হ্র))([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("krZ"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("rrZ"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("yrZ"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("wrZ"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("xrZ"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("irZ"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("-rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("rrrZ"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ry"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("qry"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("rry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("yry"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("wry"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("xry"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("0ry"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("rrrry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Rry"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("rr"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("arr"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("arrk"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("arra"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("arr"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("arr!"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("krr"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("krra"), "^ক(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Rg"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(গ|(জ্ঞ))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Rh"),
        "^((([রড়ঢ়]|(হ্র)))|(([রড়ঢ়]|(হ্র))্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("R"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("r"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("or"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("mr"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("1r"),
        "^(১|(1)|(এক))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("+r"), "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("rr"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("yr"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("wr"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("xr"),
        "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("zr"),
        "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("mri"),
        "^ম(্[যবম])?(্?)([ঃঁ]?)(ঋ|ৃ|(হৃ)|(([রড়ঢ়]|(হ্র))([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("shch"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ShTh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Shph"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sch"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(চ|ছ|([চছ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("skl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("skh"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(খ|(ক্ষ)|(ক্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sth"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sph"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)(ফ|(প্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("shc"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sht"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("shn"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("shm"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("shl"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Shk"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ShT"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("ShN"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?[নণঁঙঞং])|([সশষ]্?((হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))|([সশষ]্?(হ|ঃ|(হ্‌?))্?[নণঁঙঞং]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Shp"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Shf"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("Shm"), "^(((স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))্?ম)|([সশষ]্?((হ|ঃ|(হ্‌?))্?ম))|([সশষ]্?(হ|ঃ|(হ্‌?))্?ম))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("spl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sk"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sc"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sT"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("st"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sn"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sp"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sf"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ফ(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sm"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("sh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sc"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([চছ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("St"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sn"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sm"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sl"),
        "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)ল(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Sh"),
        "^(স|শ|ষ|([সশষ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("s"), "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("S"), "^([সশষ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("oo"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("OO"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("oo`"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("koo"), "^ক(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ooo"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("!oo"),
        "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("!ooo"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("aoo"), "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("oop"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)প(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ooo`"), "^((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("o`"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("oZ"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("oY"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("!o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("^o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("*o"), "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("io"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("yo"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("no"),
        "^([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)(([ওোঅ]|(অ্য)|(য়ো?))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("tth"), "^(([তটৎ]?্?(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?)))))|(([তটৎ]্?[তটৎ]?)্?(হ|ঃ|(হ্‌?)))|([তটৎ]্?[তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("t``"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("`t``"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("t``t``"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("t```"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("TT"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("Tm"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Th"),
        "^(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("tn"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)([নণঁঙঞং])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("tm"),
        "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)ম(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("th"),
        "^(থ|ঠ|([তটৎ]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("tt"), "^([তটৎ]্?[তটৎ]?)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("T"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("t"), "^([তটৎ])(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("aZ"),
        "^((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((জ|য|(জ়)|([‌‍]?্য)))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("aaZ"), "^(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("AZ"),
        "^((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((জ|য|(জ়)|([‌‍]?্য)))?)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("a`"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("a``"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ka`"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("A`"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("a"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("`a"),
        "^(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("k`a"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ia"),
        "^((ঞা)|(([ইঈিী]|(য়[িী]))(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("aaaa`"), "^(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("i`"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("i"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("`i"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("hi"),
        "^(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ih"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("i`h"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(হ|ঃ|(হ্‌?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("I`"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("I"), "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("cI"),
        "^([চছ])(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Ix"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("II"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("0I"),
        "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("oI"),
        "^(ঐ|ৈ|(([ওোঅ]|(অ্য)|(য়ো?))?([ইঈিী]|(য়[িী]))))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("u`"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("u"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ku"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("uk"),
        "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("uu"),
        "^(ঊ|ূ|(([উঊুূ]|(য়[ুূ]))(([উঊুূ]|(য়[ুূ])))?))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("iu"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("&u"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("u&"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("U`"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("U"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("yU"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("Uy"),
        "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("^U"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("U^"), "^([উঊুূ]|(য়[ুূ]))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("EE"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ee"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Ee"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("eE"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ee`"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("kee"), "^ক(্[যবম])?(্?)([ঃঁ]?)(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("eek"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("0ee"), "^(০|(0)|(শূন্য))(্[যবম])?(্?)([ঃঁ]?)(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("ee8"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)(৮|(8)|(আট))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("(ee)"), "^(ই|ঈ|ি|ী|(য়েই)|(((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("e`"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("e"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ke"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("we"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("#e#"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("`e`"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("z"), "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Z"), "^(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("rZ"),
        "^([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("kZS"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(জ|য|(জ়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)([সশষ])(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("y"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("oy"),
        "^([ওোঅ]|(অ্য)|(য়ো?))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ky"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ya"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("yaa"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(আ|(য়া)|া|((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))((([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া)))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Y"), "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("YY"),
        "^(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("iY"),
        "^([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("kY"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(য়|(ইয়)|([‌‍]?্য))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("q"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("Q"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("w"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("wa"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("-wa-"),
        "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)(([অএ]্যা?)|[আএ]|([‌‍]?(্য)?া)|(য়া))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("woo"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)((([উঊুূ]|(য়[ুূ])))|(([ওোঅ]|(অ্য)|(য়ো?))?([ওোঅ]|(অ্য)|(য়ো?))?))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(p.convert("wre"), "^(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)([রড়ঢ়]|(হ্র))(্[যবম])?(্?)([ঃঁ]?)((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("kw"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)(ও|(ওয়)|(্ব))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert("x"), "^((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("ex"),
        "^((এ্যা?)|[এে]|([‌‍]?(্য)া)|(য়ে))(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("bx"),
        "^ব(্[যবম])?(্?)([ঃঁ]?)((ক্স)|ষ)(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert(":`"), "^$");
    assert_eq!(p.convert(":"), "^$");
    assert_eq!(p.convert("^`"), "^$");
    assert_eq!(p.convert("^"), "^$");
    assert_eq!(p.convert("k^"), "^ক(্[যবম])?(্?)([ঃঁ]?)$");
    assert_eq!(
        p.convert("k^i"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(
        p.convert("ki^"),
        "^ক(্[যবম])?(্?)([ঃঁ]?)([ইঈিী]|(য়[িী]))(্[যবম])?(্?)([ঃঁ]?)$"
    );
    assert_eq!(p.convert(",,"), "^$");
    assert_eq!(p.convert(",,,"), "^$");
    assert_eq!(p.convert(",,`,"), "^$");
    assert_eq!(p.convert("`,,"), "^$");
    assert_eq!(p.convert(",`,"), "^$");
    assert_eq!(p.convert("$"), "^$");
    assert_eq!(p.convert("`"), "^$");
    assert_eq!(p.convert("bdh"), "^((ব্?(ধ|ঢ|([দড]্?(হ|ঃ|(হ্‌?)))))|((ব্?[দড])্?(হ|ঃ|(হ্‌?)))|(ব্?[দড]্?(হ|ঃ|(হ্‌?))))(্[যবম])?(্?)([ঃঁ]?)$");
}